title: Remote Desktop Software Downloaded
id: c6298ace-1bd4-4f29-b57a-224244db9573
status: experimental
description: Detects downloaded remote desktop software used by scammers
references:
    - https://attack.mitre.org/techniques/T1219/
author: SteveSec
date: 2024/01/24
modified: 2024/01/24
tags:
    - attack.discovery
    - attack.remote_access
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|startswith: 'C:\Users\'
        TargetFilename|contains: '\Downloads\'
        TargetFilename|endswith:
            - '*anydesk*.exe'
            - '*ANYDESK*.exe'
            - '*AnyDesk*.exe'
            - '*TeamViewer*.exe'
            - '*TEAMVIEWER*.exe'
            - '*teamviewer*.exe'
            - '*ultraviewer*.exe'
            - '*ULTRAVIEWER*.exe'
            - '*UltraViewer*.exe'
            - '*logmein*.exe'
            - '*LOGMEIN*.exe'
            - '*LogMeIn*.exe'
            - '*gotomypc*.exe'
            - '*GOTOMYPC*.exe'
            - '*GoToMyPC*.exe'
            - '*zoho assist*.exe'
            - '*ZOHO ASSIST*.exe'
            - '*Zoho Assist*.exe'
            - '*supremo*.exe'
            - '*SUPREMO*.exe'
            - '*SupRemo*.exe'
            - '*ammyy admin*.exe'
            - '*AMMYY ADMIN*.exe'
            - '*Ammyy Admin*.exe'
            - '*remotepc*.exe'
            - '*REMOTEPC*.exe'
            - '*RemotePC*.exe'
            - '*showmypc*.exe'
            - '*SHOWMYPC*.exe'
            - '*ShowMyPC*.exe'
            - '*connectwise control*'
            - '*CONNECTWISE CONTROL*'
            - '*ConnectWise Control*'
            - '*vnc*.exe'
            - '*VNC*.exe'
            - '*splashtop*.exe'
            - '*SPLASHTOP*.exe'
            - '*Splashtop*.exe'
            - '*quick assist*.exe'
            - '*QUICK ASSIST*.exe'
            - '*Quick Assist*.exe'
            - '*radmin*'
            - '*RADMIN*'
            - '*Radmin*'
            - '*remote utilities*'
            - '*REMOTE UTILITIES*'
            - '*Remote Utilities*'
    condition: selection
falsepositives:
    - IT department software deployments
    - Legitimate remote support scenarios
level: high
